{
  "description.description": "Tradutor de Projeto",
  "configuration.title": "Tradutor de Projeto",
  "command.translateFolders": "Tradutor de Projeto: Traduzir Pastas",
  "command.translateProject": "Tradutor de Projeto: Traduzir Projeto",
  "command.translateFiles": "Tradutor de Projeto: Traduzir Arquivos",
  "command.pauseTranslation": "Tradutor de Projeto: Pausar Tradução",
  "command.resumeTranslation": "Tradutor de Projeto: Retomar Tradução",
  "command.stopTranslation": "Tradutor de Projeto: Parar Tradução",
  "command.addFileToTranslationSettings": "Tradutor de Projeto: Adicionar à Tradução do Projeto",
  "command.addFolderToTranslationSettings": "Tradutor de Projeto: Adicionar à Tradução do Projeto",
  "command.exportSettingsToConfig": "Tradutor de Projeto: Exportar Configurações para project.translation.json",
  "config.sourceFolder.description": "Caminho da pasta de origem, usado para armazenar o último caminho de pasta de tradução selecionado",
  "config.targetFolders.description": "Configuração da pasta de destino da tradução, podem ser especificadas múltiplas pastas de destino e seus respectivos idiomas-alvo",
  "config.translationIntervalDays.description": "Dias de intervalo de tradução, se o arquivo de destino já existir e tiver sido traduzido dentro deste número de dias, será ignorado",
  "config.currentVendor.description": "Fornecedor de API atualmente utilizado",
  "config.vendors.description": "Lista de configuração de fornecedores de API",
  "config.vendor.name.description": "Nome do fornecedor de API",
  "config.vendor.apiEndpoint.description": "URL do endpoint da API do fornecedor",
  "config.vendor.apiKey.description": "Chave de API para autenticação com o fornecedor",
  "config.vendor.apiKeyEnvVarName.description": "Nome da variável de ambiente que contém a chave de API; se não definida, a chave será usada diretamente. O uso de variáveis de ambiente é recomendado por segurança.",
  "config.vendor.model.description": "Nome do modelo a ser usado na tradução",
  "config.vendor.rpm.description": "Limite máximo de requisições por minuto",
  "config.vendor.maxTokensPerSegment.description": "Número máximo de tokens por segmento de tradução",
  "config.vendor.timeout.description": "Tempo limite em segundos para requisições à API",
  "config.vendor.temperature.description": "Configuração de temperatura para o modelo (0-2), valores mais baixos produzem saídas mais consistentes",
  "config.vendor.streamMode.description": "Habilitar modo de streaming para saída de tradução em tempo real conforme o modelo gera o texto",
  "config.systemPrompts.description": "Array de prompts do sistema, usado para orientar o processo de tradução. Pode conter texto direto do prompt ou caminhos de arquivos (relativos à raiz do workspace). Se vazio, usa o prompt padrão. Exemplo: ['prompts/meu-prompt.md', 'Texto direto do prompt']",
  "config.userPrompts.description": "Array de prompts definidos pelo usuário, esses prompts serão adicionados após os prompts do sistema durante o processo de tradução. Pode conter texto direto do prompt ou caminhos de arquivos (relativos à raiz do workspace). Exemplo: ['prompts/instrucoes-personalizadas.md', 'Instruções adicionais']",
  "config.segmentationMarkers.description": "Marcadores de segmentação configurados por tipo de arquivo, com suporte a expressões regulares",
  "config.language.description": "Idioma da extensão",
  "config.sourceFile.description": "Caminho absoluto do arquivo de origem",
  "config.targetFiles.description": "Configuração dos arquivos de destino para tradução de arquivo",
  "config.targetLanguage.description": "Código do idioma de destino",
  "config.enableMetrics.description": "Habilitar ou desabilitar o envio de métricas anônimas de uso para ajudar a melhorar a extensão",
  "config.specifiedFiles.description": "Múltiplos arquivos de origem com seus respectivos arquivos de destino para tradução",
  "config.specifiedFolders.description": "Múltiplas pastas de origem com suas respectivas pastas de destino para tradução",
  "config.copyOnly.description": "Arquivos e caminhos que devem ser copiados para o local de destino, mas não traduzidos",
  "config.copyOnly.paths.description": "Lista de padrões de caminho (sintaxe glob) para arquivos que devem ser copiados, mas não traduzidos",
  "config.copyOnly.extensions.description": "Lista de extensões de arquivos que devem ser copiadas, mas não traduzidas",
  "config.ignore.description": "Arquivos e caminhos que devem ser completamente ignorados (nem copiados nem traduzidos)",
  "config.ignore.paths.description": "Lista de padrões de caminho (sintaxe glob) para arquivos que devem ser completamente ignorados",
  "config.ignore.extensions.description": "Lista de extensões de arquivos que devem ser completamente ignoradas"
}