
{
  "description.description": "Traductor de Proyectos",
  "configuration.title": "Traductor de Proyectos",
  "command.translateFolders": "Traductor de Proyectos: Traducir Carpetas",
  "command.translateProject": "Traductor de Proyectos: Traducir Proyecto",
  "command.translateFiles": "Traductor de Proyectos: Traducir Archivos",
  "command.pauseTranslation": "Traductor de Proyectos: Pausar Traducción",
  "command.resumeTranslation": "Traductor de Proyectos: Reanudar Traducción",
  "command.cancelTranslation": "Traductor de Proyectos: Cancelar Traducción",
  "command.addFileToTranslationSettings": "Traductor de Proyectos: Añadir a Traducción de Proyecto",
  "command.addFolderToTranslationSettings": "Traductor de Proyectos: Añadir a Traducción de Proyecto",
  "command.exportSettingsToConfig": "Traductor de Proyectos: Exportar Configuración a project.translation.json",
  "command.enableAutoTranslateOnOpen": "Traductor de Proyectos: Habilitar Traducción Automática al Abrir Carpeta",
  "command.disableAutoTranslateOnOpen": "Traductor de Proyectos: Deshabilitar Traducción Automática al Abrir Carpeta",
  "config.sourceFolder.description": "Ruta de la carpeta fuente, utilizada para almacenar la última ruta de carpeta de traducción seleccionada",
  "config.targetFolders.description": "Configuración de carpetas destino para traducción, se pueden especificar múltiples carpetas destino y sus idiomas objetivo correspondientes",
  "config.translationIntervalDays.description": "Días de intervalo de traducción, si el archivo destino existe y ha sido traducido dentro de este número de días, se omitirá",
  "config.currentVendor.description": "Proveedor de API actualmente utilizado",
  "config.vendors.description": "Lista de configuración de proveedores de API",
  "config.systemPromptLanguage.description": "Idioma utilizado para las instrucciones del sistema integradas (predeterminado: en). Esto afecta cómo se instruye al modelo, no el idioma de la interfaz de usuario.",
  "config.vendor.name.description": "Nombre del proveedor de API",
  "config.vendor.apiEndpoint.description": "URL del endpoint API para el proveedor",
  "config.vendor.apiKey.description": "Clave API para autenticación con el proveedor",
  "config.vendor.apiKeyEnvVarName.description": "Nombre de la variable de entorno que contiene la clave API, si no está configurada, se usará directamente la clave API. Se recomienda usar variables de entorno por seguridad.",
  "config.vendor.model.description": "Nombre del modelo a utilizar para la traducción",
  "config.vendor.rpm.description": "Límite máximo de solicitudes por minuto",
  "config.vendor.maxTokensPerSegment.description": "Número máximo de tokens por segmento de traducción",
  "config.vendor.timeout.description": "Tiempo de espera en segundos para solicitudes API",
  "config.vendor.temperature.description": "Configuración de temperatura para el modelo (0-2), valores más bajos producen resultados más consistentes",
  "config.vendor.streamMode.description": "Habilitar modo streaming para salida de traducción en tiempo real mientras el modelo genera texto",
  "config.customPrompts.description": "Array de instrucciones personalizadas, añadidas a la instrucción del sistema predeterminada. Puede contener texto de instrucción directamente o rutas de archivo (relativas a la raíz del espacio de trabajo). Ejemplo: ['prompts/custom-instructions.md', 'Instrucciones adicionales']",
  "config.segmentationMarkers.description": "Marcadores de segmentación configurados por tipo de archivo, admitiendo expresiones regulares",
  "config.language.description": "Idioma para la extensión",
  "config.sourceFile.description": "Ruta absoluta al archivo fuente",
  "config.targetFiles.description": "Configuración de archivos destino para traducción de archivos",
  "config.targetLanguage.description": "Código de idioma objetivo",
  "config.enableMetrics.description": "Habilitar o deshabilitar el envío de métricas de uso anónimas para ayudar a mejorar la extensión",
  "config.specifiedFiles.description": "Múltiples archivos fuente con sus archivos destino correspondientes para traducción",
  "config.specifiedFolders.description": "Múltiples carpetas fuente con sus carpetas destino correspondientes para traducción",
  "config.copyOnly.description": "Archivos y rutas que deben copiarse a la ubicación destino pero no traducirse",
  "config.copyOnly.paths.description": "Lista de patrones de ruta (sintaxis glob) para archivos que deben copiarse pero no traducirse",
  "config.copyOnly.extensions.description": "Lista de extensiones de archivo que deben copiarse pero no traducirse",
  "config.ignore.description": "Archivos y rutas que deben ignorarse completamente (ni copiarse ni traducirse)",
  "config.ignore.paths.description": "Lista de patrones de ruta (sintaxis glob) para archivos que deben ignorarse completamente",
  "config.ignore.extensions.description": "Lista de extensiones de archivo que deben ignorarse completamente"
}