{
  "description.description": "Traducteur de projet",
  "configuration.title": "Traducteur de projet",
  "command.translateFolders": "Traducteur de projet : Traduire les dossiers",
  "command.translateProject": "Traducteur de projet : Traduire le projet",
  "command.translateFiles": "Traducteur de projet : Traduire les fichiers",
  "command.pauseTranslation": "Traducteur de projet : Mettre en pause la traduction",
  "command.resumeTranslation": "Traducteur de projet : Reprendre la traduction",
  "command.stopTranslation": "Traducteur de projet : Arrêter la traduction",
  "command.addFileToTranslationSettings": "Traducteur de projet : Ajouter à la traduction du projet",
  "command.addFolderToTranslationSettings": "Traducteur de projet : Ajouter à la traduction du projet",
  "command.exportSettingsToConfig": "Traducteur de projet : Exporter les paramètres vers project.translation.json",
  "config.sourceFolder.description": "Chemin du dossier source, utilisé pour stocker le dernier chemin de dossier de traduction sélectionné",
  "config.targetFolders.description": "Configuration des dossiers cibles de traduction, plusieurs dossiers cibles et leurs langues cibles correspondantes peuvent être spécifiés",
  "config.translationIntervalDays.description": "Intervalle de jours pour la traduction, si le fichier cible existe et a été traduit dans ce nombre de jours, il sera ignoré",
  "config.currentVendor.description": "Fournisseur d'API actuellement utilisé",
  "config.vendors.description": "Liste de configuration des fournisseurs d'API",
  "config.vendor.name.description": "Nom du fournisseur d'API",
  "config.vendor.apiEndpoint.description": "URL de l'endpoint API pour le fournisseur",
  "config.vendor.apiKey.description": "Clé API pour l'authentification auprès du fournisseur",
  "config.vendor.apiKeyEnvVarName.description": "Nom de la variable d'environnement contenant la clé API, si non définie, la clé API sera utilisée directement. L'utilisation de variables d'environnement est recommandée pour la sécurité.",
  "config.vendor.model.description": "Nom du modèle à utiliser pour la traduction",
  "config.vendor.rpm.description": "Limite maximale de requêtes par minute",
  "config.vendor.maxTokensPerSegment.description": "Nombre maximum de jetons par segment de traduction",
  "config.vendor.timeout.description": "Délai d'attente en secondes pour les requêtes API",
  "config.vendor.temperature.description": "Paramètre de température pour le modèle (0-2), les valeurs inférieures produisent des sorties plus cohérentes",
  "config.vendor.streamMode.description": "Activer le mode streaming pour une sortie de traduction en temps réel au fur et à mesure que le modèle génère du texte",
  "config.systemPrompts.description": "Tableau de prompts système, utilisé pour guider le processus de traduction. Peut contenir soit du texte de prompt directement, soit des chemins de fichiers (relatifs à la racine de l'espace de travail). Si vide, utilise le prompt système par défaut. Exemple : ['prompts/my-prompt.md', 'Texte de prompt direct']",
  "config.userPrompts.description": "Tableau de prompts définis par l'utilisateur, ces prompts seront ajoutés après les prompts système pendant le processus de traduction. Peut contenir soit du texte de prompt directement, soit des chemins de fichiers (relatifs à la racine de l'espace de travail). Exemple : ['prompts/custom-instructions.md', 'Instructions supplémentaires']",
  "config.segmentationMarkers.description": "Marqueurs de segmentation configurés par type de fichier, prenant en charge les expressions régulières",
  "config.language.description": "Langue de l'extension",
  "config.sourceFile.description": "Chemin absolu du fichier source",
  "config.targetFiles.description": "Configuration des fichiers cibles pour la traduction de fichiers",
  "config.targetLanguage.description": "Code de la langue cible",
  "config.enableMetrics.description": "Activer ou désactiver l'envoi de métriques d'utilisation anonymes pour aider à améliorer l'extension",
  "config.specifiedFiles.description": "Plusieurs fichiers sources avec leurs fichiers de destination correspondants pour la traduction",
  "config.specifiedFolders.description": "Plusieurs dossiers sources avec leurs dossiers de destination correspondants pour la traduction",
  "config.copyOnly.description": "Fichiers et chemins qui doivent être copiés vers l'emplacement cible mais non traduits",
  "config.copyOnly.paths.description": "Liste des motifs de chemin (syntaxe glob) pour les fichiers qui doivent être copiés mais non traduits",
  "config.copyOnly.extensions.description": "Liste des extensions de fichiers qui doivent être copiées mais non traduites",
  "config.ignore.description": "Fichiers et chemins qui doivent être complètement ignorés (ni copiés ni traduits)",
  "config.ignore.paths.description": "Liste des motifs de chemin (syntaxe glob) pour les fichiers qui doivent être complètement ignorés",
  "config.ignore.extensions.description": "Liste des extensions de fichiers qui doivent être complètement ignorées",
  "config.diffApply.description": "(Expérimental) Configuration du mode de traduction Diff Apply - permet des mises à jour de traduction précises ligne par ligne en utilisant des opérations différentielles",
  "config.diffApply.enabled.description": "(Expérimental) Activer le mode de traduction Diff Apply pour des mises à jour de traduction plus précises et incrémentielles",
  "config.diffApply.validationLevel.description": "(Expérimental) Niveau de validation pour les opérations diff : strict (validation approfondie), normal (équilibré), loose (validation minimale)",
  "config.diffApply.autoBackup.description": "(Expérimental) Créer automatiquement des fichiers de sauvegarde avant d'appliquer les opérations diff",
  "config.diffApply.maxOperationsPerFile.description": "(Expérimental) Nombre maximum d'opérations diff autorisées par fichier pour éviter des modifications excessives"
}