
{
  "description.description": "Traductor de Proyectos",
  "configuration.title": "Traductor de Proyectos",
  "command.translateFolders": "Traductor de Proyectos: Traducir Carpetas",
  "command.translateProject": "Traductor de Proyectos: Traducir Proyecto",
  "command.translateFiles": "Traductor de Proyectos: Traducir Archivos",
  "command.pauseTranslation": "Traductor de Proyectos: Pausar Traducción",
  "command.resumeTranslation": "Traductor de Proyectos: Reanudar Traducción",
  "command.cancelTranslation": "Traductor de Proyectos: Cancelar Traducción",
  "command.addFileToTranslationSettings": "Traductor de Proyectos: Añadir a Traducción del Proyecto",
  "command.addFolderToTranslationSettings": "Traductor de Proyectos: Añadir a Traducción del Proyecto",
  "command.exportSettingsToConfig": "Traductor de Proyectos: Exportar Configuración a project.translation.json",
  "command.enableAutoTranslateOnOpen": "Traductor de Proyectos: Activar Traducción Automática al Abrir Carpeta",
  "command.disableAutoTranslateOnOpen": "Traductor de Proyectos: Desactivar Traducción Automática al Abrir Carpeta",
  "config.sourceFolder.description": "Ruta de la carpeta de origen, utilizada para almacenar la última ruta de la carpeta de traducción seleccionada",
  "config.targetFolders.description": "Configuración de la carpeta de destino de la traducción, se pueden especificar varias carpetas de destino y sus idiomas de destino correspondientes",
  "config.translationIntervalDays.description": "Días de intervalo de traducción, si el archivo de destino existe y ha sido traducido dentro de este número de días, se omitirá",
  "config.currentVendor.description": "Proveedor de API utilizado actualmente",
  "config.vendors.description": "Lista de configuración de proveedores de API",
  "config.vendor.name.description": "Nombre del proveedor de la API",
  "config.vendor.apiEndpoint.description": "URL del endpoint de la API para el proveedor",
  "config.vendor.apiKey.description": "Clave de API para la autenticación con el proveedor",
  "config.vendor.apiKeyEnvVarName.description": "Nombre de la variable de entorno que contiene la clave de la API, si no se establece, se usará directamente la clave de la API. Se recomienda usar variables de entorno por seguridad.",
  "config.vendor.model.description": "Nombre del modelo a usar para la traducción",
  "config.vendor.rpm.description": "Límite máximo de solicitudes por minuto",
  "config.vendor.maxTokensPerSegment.description": "Número máximo de tokens por segmento de traducción",
  "config.vendor.timeout.description": "Tiempo de espera en segundos para las solicitudes de la API",
  "config.vendor.temperature.description": "Ajuste de temperatura para el modelo (0-2), los valores más bajos producen resultados más consistentes",
  "config.vendor.streamMode.description": "Activar el modo de transmisión para la salida de la traducción en tiempo real a medida que el modelo genera texto",
  "config.systemPrompts.description": "Array de prompts del sistema, utilizado para guiar el proceso de traducción. Puede contener texto del prompt directamente o rutas de archivo (relativas a la raíz del espacio de trabajo). Si está vacío, se usa el prompt del sistema por defecto. Ejemplo: ['prompts/my-prompt.md', 'Texto del prompt directo']",
  "config.userPrompts.description": "Array de prompts definidos por el usuario, estos prompts se añadirán después de los prompts del sistema durante el proceso de traducción. Puede contener texto del prompt directamente o rutas de archivo (relativas a la raíz del espacio de trabajo). Ejemplo: ['prompts/custom-instructions.md', 'Instrucciones adicionales']",
  "config.segmentationMarkers.description": "Marcadores de segmentación configurados por tipo de archivo, soportando expresiones regulares",
  "config.language.description": "Idioma para la extensión",
  "config.sourceFile.description": "Ruta absoluta al archivo de origen",
  "config.targetFiles.description": "Configuración de archivos de destino para la traducción de archivos",
  "config.targetLanguage.description": "Código del idioma de destino",
  "config.enableMetrics.description": "Activar o desactivar el envío de métricas de uso anónimas para ayudar a mejorar la extensión",
  "config.specifiedFiles.description": "Múltiples archivos de origen con sus archivos de destino correspondientes para la traducción",
  "config.specifiedFolders.description": "Múltiples carpetas de origen con sus carpetas de destino correspondientes para la traducción",
  "config.copyOnly.description": "Archivos y rutas que deben ser copiados a la ubicación de destino pero no traducidos",
  "config.copyOnly.paths.description": "Lista de patrones de ruta (sintaxis glob) para los archivos que deben ser copiados pero no traducidos",  "config.copyOnly.extensions.description": "Lista de extensiones de archivo que deben ser copiadas pero no traducidas",
  "config.ignore.description": "Archivos y rutas que deben ser completamente ignorados (ni copiados ni traducidos)",
  "config.ignore.paths.description": "Lista de patrones de ruta (sintaxis glob) para los archivos que deben ser completamente ignorados",
  "config.ignore.extensions.description": "Lista de extensiones de archivo que deben ser completamente ignoradas"
}