
{
  "description.description": "Tradutor de Projeto",
  "configuration.title": "Tradutor de Projeto",
  "command.translateFolders": "Tradutor de Projeto: Traduzir Pastas",
  "command.translateProject": "Tradutor de Projeto: Traduzir Projeto",
  "command.translateFiles": "Tradutor de Projeto: Traduzir Arquivos",
  "command.pauseTranslation": "Tradutor de Projeto: Pausar Tradução",
  "command.resumeTranslation": "Tradutor de Projeto: Retomar Tradução",
  "command.cancelTranslation": "Tradutor de Projeto: Cancelar Tradução",
  "command.addFileToTranslationSettings": "Tradutor de Projeto: Adicionar à Tradução do Projeto",
  "command.addFolderToTranslationSettings": "Tradutor de Projeto: Adicionar à Tradução do Projeto",
  "command.exportSettingsToConfig": "Tradutor de Projeto: Exportar Configurações para project.translation.json",
  "command.enableAutoTranslateOnOpen": "Tradutor de Projeto: Habilitar Tradução Automática ao Abrir Pasta",
  "command.disableAutoTranslateOnOpen": "Tradutor de Projeto: Desabilitar Tradução Automática ao Abrir Pasta",
  "config.sourceFolder.description": "Caminho da pasta de origem, usado para armazenar o caminho da última pasta de tradução selecionada",
  "config.targetFolders.description": "Configuração da pasta de destino da tradução, múltiplas pastas de destino e seus idiomas de destino correspondentes podem ser especificados",
  "config.translationIntervalDays.description": "Intervalo de dias para tradução, se o arquivo de destino existe e foi traduzido dentro deste número de dias, ele será ignorado",
  "config.currentVendor.description": "Fornecedor de API atualmente em uso",
  "config.vendors.description": "Lista de configuração de fornecedores de API",
  "config.vendor.name.description": "Nome do fornecedor da API",
  "config.vendor.apiEndpoint.description": "URL do endpoint da API para o fornecedor",
  "config.vendor.apiKey.description": "Chave da API para autenticação com o fornecedor",
  "config.vendor.apiKeyEnvVarName.description": "Nome da variável de ambiente que contém a chave da API, se não definido, a chave da API será usada diretamente. O uso de variáveis de ambiente é recomendado para segurança.",
  "config.vendor.model.description": "Nome do modelo a ser usado para tradução",
  "config.vendor.rpm.description": "Limite máximo de requisições por minuto",
  "config.vendor.maxTokensPerSegment.description": "Número máximo de tokens por segmento de tradução",
  "config.vendor.timeout.description": "Timeout em segundos para requisições da API",
  "config.vendor.temperature.description": "Configuração de temperatura para o modelo (0-2), valores mais baixos produzem saídas mais consistentes",
  "config.vendor.streamMode.description": "Habilitar modo de streaming para saída de tradução em tempo real conforme o modelo gera o texto",
  "config.systemPrompts.description": "Array de prompts do sistema, usado para guiar o processo de tradução. Pode conter texto de prompt diretamente ou caminhos de arquivo (relativos à raiz do workspace). Se estiver vazio, usa o prompt do sistema padrão. Exemplo: ['prompts/my-prompt.md', 'Texto de prompt direto']",
  "config.userPrompts.description": "Array de prompts definidos pelo usuário, estes prompts serão adicionados após os prompts do sistema durante o processo de tradução. Pode conter texto de prompt diretamente ou caminhos de arquivo (relativos à raiz do workspace). Exemplo: ['prompts/custom-instructions.md', 'Instruções adicionais']",
  "config.segmentationMarkers.description": "Marcadores de segmentação configurados por tipo de arquivo, suportando expressões regulares",
  "config.language.description": "Idioma para a extensão",
  "config.sourceFile.description": "Caminho absoluto para o arquivo de origem",
  "config.targetFiles.description": "Configuração de arquivos de destino para tradução de arquivo",
  "config.targetLanguage.description": "Código do idioma de destino",
  "config.enableMetrics.description": "Habilitar ou desabilitar o envio de métricas de uso anônimas para ajudar a melhorar a extensão",
  "config.specifiedFiles.description": "Múltiplos arquivos de origem com seus respectivos arquivos de destino para tradução",
  "config.specifiedFolders.description": "Múltiplas pastas de origem com suas respectivas pastas de destino para tradução",
  "config.copyOnly.description": "Arquivos e caminhos que devem ser copiados para o local de destino, mas não traduzidos",
  "config.copyOnly.paths.description": "Lista de padrões de caminho (sintaxe glob) para arquivos que devem ser copiados, mas não traduzidos",  "config.copyOnly.extensions.description": "Lista de extensões de arquivo que devem ser copiadas, mas não traduzidas",
  "config.ignore.description": "Arquivos e caminhos que devem ser completamente ignorados (nem copiados nem traduzidos)",
  "config.ignore.paths.description": "Lista de padrões de caminho (sintaxe glob) para arquivos que devem ser completamente ignorados",
  "config.ignore.extensions.description": "Lista de extensões de arquivo que devem ser completamente ignorados"
}