{
  "description.description": "Traductor de Proyecto",
  "configuration.title": "Traductor de Proyecto",
  "command.translateFolders": "Traductor de Proyecto: Traducir Carpetas",
  "command.translateProject": "Traductor de Proyecto: Traducir Proyecto",
  "command.translateFiles": "Traductor de Proyecto: Traducir Archivos",
  "command.pauseTranslation": "Traductor de Proyecto: Pausar Traducción",
  "command.resumeTranslation": "Traductor de Proyecto: Reanudar Traducción",
  "command.stopTranslation": "Traductor de Proyecto: Detener Traducción",
  "command.addFileToTranslationSettings": "Traductor de Proyecto: Agregar a la Traducción del Proyecto",
  "command.addFolderToTranslationSettings": "Traductor de Proyecto: Agregar a la Traducción del Proyecto",
  "command.exportSettingsToConfig": "Traductor de Proyecto: Exportar Configuración a project.translation.json",
  "config.sourceFolder.description": "Ruta de la carpeta de origen, utilizada para almacenar la última ruta de carpeta de traducción seleccionada",
  "config.targetFolders.description": "Configuración de carpetas de destino de traducción, se pueden especificar múltiples carpetas de destino y sus idiomas correspondientes",
  "config.translationIntervalDays.description": "Días de intervalo de traducción, si el archivo de destino existe y se ha traducido dentro de este número de días, se omitirá",
  "config.currentVendor.description": "Proveedor de API actualmente en uso",
  "config.vendors.description": "Lista de configuración de proveedores de API",
  "config.vendor.name.description": "Nombre del proveedor de API",
  "config.vendor.apiEndpoint.description": "URL del punto de acceso (endpoint) de la API del proveedor",
  "config.vendor.apiKey.description": "Clave API para autenticación con el proveedor",
  "config.vendor.apiKeyEnvVarName.description": "Nombre de la variable de entorno que contiene la clave API; si no se establece, se usará directamente la clave API. Se recomienda usar variables de entorno por seguridad.",
  "config.vendor.model.description": "Nombre del modelo a usar para la traducción",
  "config.vendor.rpm.description": "Límite máximo de solicitudes por minuto",
  "config.vendor.maxTokensPerSegment.description": "Número máximo de tokens por segmento de traducción",
  "config.vendor.timeout.description": "Tiempo de espera en segundos para las solicitudes de API",
  "config.vendor.temperature.description": "Ajuste de temperatura para el modelo (0-2), valores más bajos producen resultados más consistentes",
  "config.vendor.streamMode.description": "Habilitar modo de transmisión para obtener resultados de traducción en tiempo real mientras el modelo genera el texto",
  "config.systemPrompts.description": "Matriz de indicaciones del sistema, utilizada para guiar el proceso de traducción. Puede contener texto directo de indicaciones o rutas de archivos (relativas a la raíz del espacio de trabajo). Si está vacío, se usa la indicación del sistema predeterminada. Ejemplo: ['prompts/my-prompt.md', 'Texto de indicación directa']",
  "config.userPrompts.description": "Matriz de indicaciones definidas por el usuario, estas indicaciones se agregarán después de las indicaciones del sistema durante el proceso de traducción. Puede contener texto directo de indicaciones o rutas de archivos (relativas a la raíz del espacio de trabajo). Ejemplo: ['prompts/custom-instructions.md', 'Instrucciones adicionales']",
  "config.segmentationMarkers.description": "Marcadores de segmentación configurados por tipo de archivo, admiten expresiones regulares",
  "config.language.description": "Idioma para la extensión",
  "config.sourceFile.description": "Ruta absoluta al archivo de origen",
  "config.targetFiles.description": "Configuración de archivos de destino para la traducción de archivos",
  "config.targetLanguage.description": "Código del idioma de destino",
  "config.enableMetrics.description": "Habilitar o deshabilitar el envío de métricas anónimas de uso para ayudar a mejorar la extensión",
  "config.specifiedFiles.description": "Múltiples archivos de origen con sus archivos de destino correspondientes para traducción",
  "config.specifiedFolders.description": "Múltiples carpetas de origen con sus carpetas de destino correspondientes para traducción",
  "config.copyOnly.description": "Archivos y rutas que deben copiarse a la ubicación de destino pero no traducirse",
  "config.copyOnly.paths.description": "Lista de patrones de ruta (sintaxis glob) para archivos que deben copiarse pero no traducirse",
  "config.copyOnly.extensions.description": "Lista de extensiones de archivo que deben copiarse pero no traducirse",
  "config.ignore.description": "Archivos y rutas que deben ignorarse completamente (ni copiarse ni traducirse)",
  "config.ignore.paths.description": "Lista de patrones de ruta (sintaxis glob) para archivos que deben ignorarse completamente",
  "config.ignore.extensions.description": "Lista de extensiones de archivo que deben ignorarse completamente"
}