
{
  "description.description": "Traducteur de Projet",
  "configuration.title": "Traducteur de Projet",
  "command.translateFolders": "Traducteur de Projet: Traduire les Dossiers",
  "command.translateProject": "Traducteur de Projet: Traduire le Projet",
  "command.translateFiles": "Traducteur de Projet: Traduire les Fichiers",
  "command.pauseTranslation": "Traducteur de Projet: Mettre en Pause la Traduction",
  "command.resumeTranslation": "Traducteur de Projet: Reprendre la Traduction",
  "command.cancelTranslation": "Traducteur de Projet: Annuler la Traduction",
  "command.addFileToTranslationSettings": "Traducteur de Projet: Ajouter à la Traduction du Projet",
  "command.addFolderToTranslationSettings": "Traducteur de Projet: Ajouter à la Traduction du Projet",
  "command.exportSettingsToConfig": "Traducteur de Projet: Exporter les Paramètres vers project.translation.json",
  "command.enableAutoTranslateOnOpen": "Traducteur de Projet: Activer la Traduction Automatique à l'Ouverture du Dossier",
  "command.disableAutoTranslateOnOpen": "Traducteur de Projet: Désactiver la Traduction Automatique à l'Ouverture du Dossier",
  "config.sourceFolder.description": "Chemin du dossier source, utilisé pour stocker le dernier chemin de dossier de traduction sélectionné",
  "config.targetFolders.description": "Configuration du dossier cible de traduction, plusieurs dossiers cibles et leurs langues cibles correspondantes peuvent être spécifiés",
  "config.translationIntervalDays.description": "Intervalle de jours de traduction, si le fichier cible existe et a été traduit dans ce nombre de jours, il sera ignoré",
  "config.currentVendor.description": "Fournisseur d'API actuellement utilisé",
  "config.vendors.description": "Liste de configuration des fournisseurs d'API",
  "config.vendor.name.description": "Nom du fournisseur d'API",
  "config.vendor.apiEndpoint.description": "URL du point de terminaison de l'API pour le fournisseur",
  "config.vendor.apiKey.description": "Clé d'API pour l'authentification auprès du fournisseur",
  "config.vendor.apiKeyEnvVarName.description": "Nom de la variable d'environnement contenant la clé d'API, si non défini, la clé d'API sera utilisée directement. L'utilisation de variables d'environnement est recommandée pour la sécurité.",
  "config.vendor.model.description": "Nom du modèle à utiliser pour la traduction",
  "config.vendor.rpm.description": "Limite maximale de requêtes par minute",
  "config.vendor.maxTokensPerSegment.description": "Nombre maximum de jetons par segment de traduction",
  "config.vendor.timeout.description": "Délai d'attente en secondes pour les requêtes API",
  "config.vendor.temperature.description": "Paramètre de température pour le modèle (0-2), des valeurs plus basses produisent des résultats plus cohérents",
  "config.vendor.streamMode.description": "Activer le mode streaming pour une sortie de traduction en temps réel pendant que le modèle génère le texte",
  "config.systemPrompts.description": "Tableau de prompts système, utilisé pour guider le processus de traduction. Peut contenir soit du texte de prompt directement, soit des chemins de fichiers (relatifs à la racine de l'espace de travail). S'il est vide, utilise le prompt système par défaut. Exemple : ['prompts/my-prompt.md', 'Texte de prompt direct']",
  "config.userPrompts.description": "Tableau de prompts définis par l'utilisateur, ces prompts seront ajoutés après les prompts système pendant le processus de traduction. Peut contenir soit du texte de prompt directement, soit des chemins de fichiers (relatifs à la racine de l'espace de travail). Exemple : ['prompts/custom-instructions.md', 'Instructions supplémentaires']",
  "config.segmentationMarkers.description": "Marqueurs de segmentation configurés par type de fichier, supportant les expressions régulières",
  "config.language.description": "Langue pour l'extension",
  "config.sourceFile.description": "Chemin absolu vers le fichier source",
  "config.targetFiles.description": "Configuration des fichiers cibles pour la traduction de fichiers",
  "config.targetLanguage.description": "Code de langue cible",
  "config.enableMetrics.description": "Activer ou désactiver l'envoi de métriques d'utilisation anonymes pour aider à améliorer l'extension",
  "config.specifiedFiles.description": "Plusieurs fichiers sources avec leurs fichiers de destination correspondants pour la traduction",
  "config.specifiedFolders.description": "Plusieurs dossiers sources avec leurs dossiers de destination correspondants pour la traduction",
  "config.copyOnly.description": "Fichiers et chemins qui doivent être copiés vers l'emplacement cible mais non traduits",
  "config.copyOnly.paths.description": "Liste des modèles de chemin (syntaxe glob) pour les fichiers qui doivent être copiés mais non traduits",  "config.copyOnly.extensions.description": "Liste des extensions de fichiers qui doivent être copiées mais non traduites",
  "config.ignore.description": "Fichiers et chemins qui doivent être complètement ignorés (ni copiés ni traduits)",
  "config.ignore.paths.description": "Liste des modèles de chemin (syntaxe glob) pour les fichiers qui doivent être complètement ignorés",
  "config.ignore.extensions.description": "Liste des extensions de fichiers qui doivent être complètement ignorées"
}