{
    "description.description": "Traductor de Proyectos",
    "command.translateFolders": "Traducir Carpetas",
    "command.translateProject": "Traducir Proyecto",
    "command.pauseTranslation": "Pausar Traducción",
    "command.resumeTranslation": "Reanudar Traducción",
    "command.stopTranslation": "Detener Traducción",
    "config.sourceFolder.description": "Ruta de la carpeta de origen, se utiliza para almacenar la última ruta de carpeta seleccionada para traducción",
    "config.destFolders.description": "Configuración de la carpeta de destino de traducción, se pueden especificar múltiples carpetas de destino y sus idiomas correspondientes",
    "config.translationIntervalDays.description": "Días de intervalo de traducción, si el archivo de destino existe y ha sido traducido dentro de este número de días, se omitirá",
    "config.ignoreTranslationExtensions.description": "Lista de extensiones de archivos de texto que no requieren traducción, los archivos se copiarán directamente a la carpeta de destino",
    "config.ignorePaths.description": "Lista de patrones de ruta a ignorar, usando comodines, los archivos no se copiarán a la carpeta de destino",
    "config.currentVendor.description": "Proveedor de API actualmente utilizado",
    "config.vendors.description": "Lista de configuraciones de proveedores de API",
    "config.vendor.name.description": "Nombre del proveedor de API",
    "config.vendor.apiEndpoint.description": "URL del punto de conexión de la API del proveedor",
    "config.vendor.apiKey.description": "Clave de API para autenticación con el proveedor",
    "config.vendor.apiKeyEnvVarName.description": "Nombre de la variable de entorno que contiene la clave de API. Si no se establece, se usará directamente la clave de API. Se recomienda usar variables de entorno por seguridad",
    "config.vendor.model.description": "Nombre del modelo a usar para la traducción",
    "config.vendor.rpm.description": "Límite máximo de solicitudes por minuto",
    "config.vendor.maxTokensPerSegment.description": "Número máximo de tokens por segmento de traducción",
    "config.vendor.timeout.description": "Tiempo de espera en segundos para las solicitudes de API",
    "config.vendor.temperature.description": "Configuración de temperatura para el modelo (0-2), valores más bajos producen salidas más coherentes",
    "config.vendor.streamMode.description": "Habilitar modo de transmisión para salida en tiempo real durante la generación de texto",
    "config.systemPrompts.description": "Matriz de prompts del sistema, utilizada para guiar el proceso de traducción. Se pueden agregar múltiples prompts",
    "config.userPrompts.description": "Matriz de prompts definidos por el usuario, estos prompts se añadirán después de los prompts del sistema durante la traducción",
    "config.segmentationMarkers.description": "Marcadores de segmentación configurados por tipo de archivo, soportan expresiones regulares",
    "config.language.description": "Idioma para la extensión",
    "config.sourceFile.description": "Ruta absoluta al archivo fuente",
    "config.destFiles.description": "Configuración de archivos de destino para la traducción del archivo",
    "config.targetLanguage.description": "Código de idioma de destino",
    "config.enableMetrics.description": "Habilitar/deshabilitar el envío de métricas anónimas para mejorar la extensión"
}