{
  "description.description": "Tradutor de Projetos",
  "configuration.title": "Tradutor de Projetos",
  "command.translateFolders": "Tradutor de Projetos: Traduzir Pastas",
  "command.translateProject": "Tradutor de Projetos: Traduzir Projeto",
  "command.translateFiles": "Tradutor de Projetos: Traduzir Arquivos",
  "command.pauseTranslation": "Tradutor de Projetos: Pausar Tradução",
  "command.resumeTranslation": "Tradutor de Projetos: Retomar Tradução",
  "command.stopTranslation": "Tradutor de Projetos: Parar Tradução",
  "command.addFileToTranslationSettings": "Tradutor de Projetos: Adicionar à Tradução do Projeto",
  "command.addFolderToTranslationSettings": "Tradutor de Projetos: Adicionar à Tradução do Projeto",
  "command.exportSettingsToConfig": "Tradutor de Projetos: Exportar Configurações para project.translation.json",
  "config.sourceFolder.description": "Caminho da pasta de origem, usado para armazenar o último caminho de pasta de tradução selecionado",
  "config.targetFolders.description": "Configuração da pasta de destino da tradução, várias pastas de destino e seus respectivos idiomas de destino podem ser especificados",
  "config.translationIntervalDays.description": "Dias de intervalo de tradução, se o arquivo de destino existir e tiver sido traduzido dentro desse número de dias, será ignorado",
  "config.currentVendor.description": "Fornecedor de API atualmente usado",
  "config.vendors.description": "Lista de configuração de fornecedores de API",
  "config.vendor.name.description": "Nome do fornecedor de API",
  "config.vendor.apiEndpoint.description": "URL do endpoint da API para o fornecedor",
  "config.vendor.apiKey.description": "Chave de API para autenticação com o fornecedor",
  "config.vendor.apiKeyEnvVarName.description": "Nome da variável de ambiente que contém a chave de API, se não estiver definida, a chave de API será usada diretamente. O uso de variáveis de ambiente é recomendado por segurança.",
  "config.vendor.model.description": "Nome do modelo a ser usado para tradução",
  "config.vendor.rpm.description": "Limite máximo de solicitações por minuto",
  "config.vendor.maxTokensPerSegment.description": "Número máximo de tokens por segmento de tradução",
  "config.vendor.timeout.description": "Tempo limite em segundos para solicitações de API",
  "config.vendor.temperature.description": "Configuração de temperatura para o modelo (0-2), valores mais baixos produzem saídas mais consistentes",
  "config.vendor.streamMode.description": "Ativar modo de streaming para saída de tradução em tempo real conforme o modelo gera texto",
  "config.systemPrompts.description": "Array de prompts do sistema, usado para orientar o processo de tradução. Pode conter texto de prompt diretamente ou caminhos de arquivos (relativos à raiz do workspace). Se vazio, usa o prompt do sistema padrão. Exemplo: ['prompts/my-prompt.md', 'Texto de prompt direto']",
  "config.userPrompts.description": "Array de prompts definidos pelo usuário, esses prompts serão adicionados após os prompts do sistema durante o processo de tradução. Pode conter texto de prompt diretamente ou caminhos de arquivos (relativos à raiz do workspace). Exemplo: ['prompts/custom-instructions.md', 'Instruções adicionais']",
  "config.segmentationMarkers.description": "Marcadores de segmentação configurados por tipo de arquivo, suportando expressões regulares",
  "config.language.description": "Idioma para a extensão",
  "config.sourceFile.description": "Caminho absoluto para o arquivo de origem",
  "config.targetFiles.description": "Configuração de arquivos de destino para tradução de arquivos",
  "config.targetLanguage.description": "Código do idioma de destino",
  "config.enableMetrics.description": "Ativar ou desativar o envio de métricas de uso anônimas para ajudar a melhorar a extensão",
  "config.specifiedFiles.description": "Vários arquivos de origem com seus respectivos arquivos de destino para tradução",
  "config.specifiedFolders.description": "Várias pastas de origem com suas respectivas pastas de destino para tradução",
  "config.copyOnly.description": "Arquivos e caminhos que devem ser copiados para o local de destino, mas não traduzidos",
  "config.copyOnly.paths.description": "Lista de padrões de caminho (sintaxe glob) para arquivos que devem ser copiados, mas não traduzidos",
  "config.copyOnly.extensions.description": "Lista de extensões de arquivos que devem ser copiadas, mas não traduzidas",
  "config.ignore.description": "Arquivos e caminhos que devem ser completamente ignorados (nem copiados nem traduzidos)",
  "config.ignore.paths.description": "Lista de padrões de caminho (sintaxe glob) para arquivos que devem ser completamente ignorados",
  "config.ignore.extensions.description": "Lista de extensões de arquivos que devem ser completamente ignoradas",
  "config.diffApply.description": "(Experimental) Configuração do modo de tradução Diff Apply - permite atualizações de tradução precisas linha por linha usando operações diferenciais",
  "config.diffApply.enabled.description": "(Experimental) Ativar o modo de tradução Diff Apply para atualizações de tradução mais precisas e incrementais",
  "config.diffApply.validationLevel.description": "(Experimental) Nível de validação para operações de diff: strict (validação rigorosa), normal (equilibrado), loose (validação mínima)",
  "config.diffApply.autoBackup.description": "(Experimental) Criar automaticamente arquivos de backup antes de aplicar operações de diff",
  "config.diffApply.maxOperationsPerFile.description": "(Experimental) Número máximo de operações de diff permitidas por arquivo para evitar alterações excessivas"
}